% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% % Ackley function.
% % The global minima: f(x)=0  
% % Position (0)  mqhoaA300维12个采样点都能达到很高的精度
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% function y = func(x,DIM)
% n = DIM;
% a = 20; b = 0.2; c = 2*pi;
% s1 = 0; s2 = 0;
% for i=1:n;
%    s1 = s1+(x(i))^2;
%    s2 = s2+cos(c*(x(i)));
% end
% y = -a*exp(-b*sqrt(1/n*s1))-exp(1/n*s2)+a+exp(1);

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% % Alpine function
% % The global minima: f(x)=0
% % Position (0)                             
%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% function y = func(x,DIM)
% n = DIM; 
% s=0;
%  for i = 1:DIM 
%         s = s + abs(x(i)*sin(x(i)) + 0.1*x(i));        
%  end
%  y=s;

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% % Griewank function
% % The global minima: f(x)=0
% % Position (0)
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% function y = func(x,DIM)
% n = DIM;
% fr = 4000;
% s = 0;
% p = 1;
% for j = 1:n; s = s+(x(j))^2; end
% for j = 1:n; p = p*cos((x(j))/sqrt(j)); end
% y = s/fr-p+1;
% 

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% % Sphere function 
% % The global minima: f(x)=0
% % Position (0)
% 高维时mqhoa的采样比较低时有效，采样越多反而不好  效果都不好
% % %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% function y = func(x,DIM)
% n = DIM;
% s = 0;
% for j = 1:n
%     s = s+(x(j))^2; 
% end
% y = s;
 

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% Rastrigin function   
% The global minima: f(x)=0
% Position (0)   一维结果凑合，但是2维以上结果开始不好，调整参数后在几百维时采样点852都能达到精度；
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% function y = func(x,DIM)
% n = DIM; 
% s = 0;
% for j = 1:n
%     s = s+((x(j)-2)^2-10*cos(2*pi*(x(j)-2))); 
% end
% y = 10*n+s;

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% % Dixon and Price function.
% % The global minima: f(x)=0   
% % Position (0)
% 只有1维效果好，对于2维的，采样密度加大也不能找到很好的效果.但是对于2维，mqhoaA在采样密度8时能达到10-12,8000采样时10-1,free也一样，在采样点很大时的效果反而更差
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% function y = func(x,DIM)
% n = DIM;
% s1 = 0;
% for j = 2:n;
%     s1 = s1+j*(2*x(j)^2-x(j-1))^2;    
% end
% y = s1+(x(1)-1)^2;

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% % Zakharov function.
% % The global minima: f(x)=0
% % Position (0)            调整参数对于几百维的数据也算不出很好的精度
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% function y = func(x,DIM)
% n = DIM;
% s1 = 0;
% s2 = 0;
% for j = 1:n;
%     s1 = s1+(x(j)-1)^2;
%     s2 = s2+0.5*j*(x(j)-1);
% end
% y = s1+s2^2+s2^4;

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% % Sum Squares Function 
% % The global minima: f(x)=0
% % Position (0)                                 效果很好
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% function y = func(x,DIM)
% n = DIM;
% s = 0;
% for j = 1:n  
%     s=s+j*x(j)^2; 
% end
% y = s;

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% % Quadric function
% % The global minima: f(x)=0
% % Position (0)                   效果一样好
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% function y = func(x,DIM)
% n = DIM; 
% s=0;
% s1 = 0;
%  for i = 1:DIM
%         for j=1:i
%              s1 = s1+x(j); 
%         end
%         s=s+s1^2;
%         s1=0;
%  end
%  y=s;  

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% % Levy function.
% % The global minima: f(x)=0
% % Position (1)
% 低维效果更好，但是5,6,7维时mqhoaA成功100%，free0%????????增加采样密度mqhoa在200维时8000多个采样点也只能达到10-5
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% function y = func(x,DIM)
% n = DIM;
% for i = 1:n 
%     z(i) = 1+(x(i)-1-2)/4; 
% end
% s = sin(pi*z(1))^2;
% for i = 1:n-1
%     s = s+(z(i)-1)^2*(1+10*(sin(pi*z(i)+1))^2);
% end 
% y = s+(z(n)-1)^2*(1+(sin(2*pi*z(n)))^2);

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% % Rosenbrock function 
% % The global minima: f(x)=0
% % Position (1)
% % DIM>1              
%groupNum     %k值10000非常精准8550也非常好
% % %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
function y = func(x,DIM)
n = DIM;
sum = 0;
for j = 1:n-1;
    sum = sum+100*(x(j)^2-x(j+1))^2+(x(j)-1)^2;
end
y = sum;

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% % Schwefel function
% % The global minima: f(x)=0
% % Position (420.9687)
% free只能使精度达到10的-4次mqhoaA:DIM=20;groupNum=8550;minDomain=-500;maxDomain=500;MFE=8500;
% 可以达到100%
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% function y = func(x,DIM)
% n = DIM;
% sum = 0;
% for i=1:n
%     sum = sum+(x(i)*sin(sqrt(abs(x(i)))));
% end
% y = 418.9829*n-sum;

%二维函数分界线
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% % Drop-Wave function
% % The global minima: f(x)=-1
% % Position (0)
% % [-5.12,5.12]
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% function  y = func(x,DIM)
% x1 = x(1);
% x2 = x(2);
% frac1 = 1 + cos(12*sqrt(x1^2+x2^2));
% frac2 = 0.5*(x1^2+x2^2) + 2;
% y = -frac1/frac2;

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% % Beale function
% % The global minima: f(3,0.5)=0
% % Position (3,0.5)
% % DIM=2
% % [-4.5,4.5]
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% free稍微差一些
% function  y = func(x,DIM)
% x1 = x(1);
% x2 = x(2);
% frac1 =(1.5-x1+x1*x2)^2 ;
% frac2 = (2.25-x1+x1*x2^2)^2;
% frac3=(2.625-x1+x1*x2^3)^2;
% y = frac1+frac2+frac3;

% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% % Three-hump camel  function
% % The global minima: f(0)=0
% % Position (0)
% % DIM=2
% % [-5,5]
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% function  y = func(x,DIM)
% x1 = x(1)-5;  %(5,5)在此点取到最小值0
% x2 = x(2)-5;
% y = 2*x1^2-1.05*x1^4+x1^6/6+x1*x2+x2^2;


% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
% % McCormick  function
% % The global minima: f(-0.54717,-1.54719)=-1.9133
% % Position (0)
% % DIM=2
% % [-4,4]
% %%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%%
%
% function  y = func(x,DIM)
% x1 = x(1);
% x2 = x(2);
% y = sin(x1+x2)+(x1-x2)^2-1.5*x1+2.5*x2+1;

